In [1]:
import pandas as pd
import sqlalchemy

In [6]:
engine= sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/sample")

In [8]:
df=pd.read_sql_table("customer",engine)
df

   ID    Name  phone_no
0   1     Ram   9876543
1   2   shyam  98736422
2   3  Geetha   7685994

In [9]:
df=pd.read_sql_table("customer",engine,columns=["Name","phone_no"])
df

     Name  phone_no
0     Ram   9876543
1   shyam  98736422
2  Geetha   7685994

In [11]:
query=''' SELECT customer.Name, customer.phone_no, orders.Name, orders.Amount
 FROM customer INNER JOIN orders
 ON customer.ID=orders.Customer_ID'''
df=pd.read_sql_query(query,engine)
df

     Name  phone_no  Name  Amount
0  Geetha   7685994  will     200
1     Ram   9876543   max     300
2   shyam  98736422  john     500

In [12]:
df=pd.read_csv("customer.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [13]:
df.rename(columns={
     'Customer Name': 'Name',
    'Customer Phone': 'phone_no'  
},inplace=True)
df

              Name    phone_no
0     rafael nadal  4567895647
1  maria sharapova   434534545
2   vladimir putin    89345345
3      kim un jong   123434456
4       jeff bezos   934534543
5     rahul gandhi    44324222

In [14]:

df.to_sql(
    name='customer',
    con=engine,
    if_exists='append',
    index=False
)